In [1]:
import pandas as pd

In [8]:
# create dataframe from dictionary with lists

In [3]:
Team = ['LAC', 'LAL', 'UTA', 'PHX', 'GSW', 'POR', 'MEM', 'SAS', 'DAL', 'DEN', 'OKC', 'NOR', 'SAC', 'HOU', 'MIN']
W = [40, 35, 45, 41, 29, 32, 29, 28, 30, 37, 20, 25, 23, 15, 15]
L = [19, 23, 15, 16, 29, 24, 27, 28, 26, 20, 38, 32, 34, 43, 43]

In [4]:
df = pd.DataFrame({'Team': Team, 'W': W, 'L': L})

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df

   Team   W   L
0   LAC  40  19
1   LAL  35  23
2   UTA  45  15
3   PHX  41  16
4   GSW  29  29
5   POR  32  24
6   MEM  29  27
7   SAS  28  28
8   DAL  30  26
9   DEN  37  20
10  OKC  20  38
11  NOR  25  32
12  SAC  23  34
13  HOU  15  43
14  MIN  15  43

In [9]:
# each list represents the team vector, or a row. 

lac = ['LAC', 40, 19]
lal = ['LAL', 35, 23]
uta = ['UTA', 45, 15]
phx = ['PHX', 41, 16] 
gsw = ['GSW', 29, 29] 
por = ['POR', 32, 24] 
mem = ['MEM', 29, 27]
sas = ['SAS', 28, 28]
dal = ['DAL', 30, 26]
den = ['DEN', 37, 20] 
okc = ['OKC', 20, 38]
nor = ['NOR', 25, 32]
sac = ['SAC', 23, 34]
hou = ['HOU', 15, 43]
minn = ['MIN',15, 43]

In [10]:
df1 = pd.DataFrame([lac,lal,uta,phx,gsw,por,mem,sas,dal,den,okc,nor,sac,hou,minn], columns = ['Team','W','L'])

In [11]:
df1

   Team   W   L
0   LAC  40  19
1   LAL  35  23
2   UTA  45  15
3   PHX  41  16
4   GSW  29  29
5   POR  32  24
6   MEM  29  27
7   SAS  28  28
8   DAL  30  26
9   DEN  37  20
10  OKC  20  38
11  NOR  25  32
12  SAC  23  34
13  HOU  15  43
14  MIN  15  43

In [14]:
from pydataset import data
color_df = data('HairEyeColor')

In [16]:
color_df.head()

    Hair    Eye   Sex  Freq
1  Black  Brown  Male    32
2  Brown  Brown  Male    53
3    Red  Brown  Male    10
4  Blond  Brown  Male     3
5  Black   Blue  Male    11

In [17]:
df1.sample(5, random_state=123)

   Team   W   L
7   SAS  28  28
10  OKC  20  38
4   GSW  29  29
0   LAC  40  19
5   POR  32  24

In [18]:
df1.sample(5, random_state=321)

   Team   W   L
5   POR  32  24
7   SAS  28  28
11  NOR  25  32
3   PHX  41  16
6   MEM  29  27

# Setting the random_state is important for reproduction and validation

In [19]:
df1.sample(frac=.25, random_state=123)

   Team   W   L
7   SAS  28  28
10  OKC  20  38
4   GSW  29  29
0   LAC  40  19

In [21]:
df1.sample(frac=.5, random_state=123)

   Team   W   L
7   SAS  28  28
10  OKC  20  38
4   GSW  29  29
0   LAC  40  19
5   POR  32  24
9   DEN  37  20
8   DAL  30  26
11  NOR  25  32

In [22]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Team    15 non-null     object
 1   W       15 non-null     int64
 2   L       15 non-null     int64
dtypes: int64(2), object(1)
memory usage: 488.0+ bytes

In [24]:
df1.describe()

               W          L
count  15.000000  15.000000
mean   29.600000  27.800000
std     9.069572   8.889802
min    15.000000  15.000000
25%    24.000000  21.500000
50%    29.000000  27.000000
75%    36.000000  33.000000
max    45.000000  43.000000

# Dataframe Attributes
 * df.dtypes: datatype of each column
 * df.shape: tuple of number of rows & columns in the dataframe
 * df.index: the labels for each row (usually autogenerated int)
 * df.columns: you can also assign new values to this attribute.
   You will notice that when calling these attributes of dataframes, they are not followed by (). When you forget, you will just get a nice error to remind you :)

In [25]:
# get the datatypes of each column
df1.dtypes

Team    object
W        int64
L        int64
dtype: object

In [26]:
# what type of object is returned when we call dtypes?
type(df1.dtypes)

pandas.core.series.Series

In [27]:
# see number of rows and columns, or the shape, of the df

In [28]:
df1.shape

(15, 3)

In [30]:
# what type of object does 'shape' return?

In [31]:
type(df1.shape)

tuple

In [32]:
# how can I get the number of rows?

In [33]:
df1.shape[0]

15

In [34]:
df1.shape[1]

3

In [35]:
# what are the row labels, or index values, of of my dataframe?

In [36]:
df1.index

RangeIndex(start=0, stop=15, step=1)

In [37]:
# What type of object does .index return?

In [38]:
type(df1.index)

pandas.core.indexes.range.RangeIndex

In [39]:
# what are the column names of my dataframe?

In [40]:
df1.columns

Index(['Team', 'W', 'L'], dtype='object')

In [ ]:
# what type of object is returned?

In [42]:
type(df1.columns)

pandas.core.indexes.base.Index

What do you notice?

Column names are also an index, like rows. Axis 0 = Rows, Axis 1 = Columns

In [43]:
# rename the columns using the .columns attribute and the .upper and .lower methods.

In [44]:
df1.columns.str.upper()

Index(['TEAM', 'W', 'L'], dtype='object')

In [46]:
df1.columns.str.lower()

Index(['team', 'w', 'l'], dtype='object')

In [48]:
df1.columns.str.capitalize()

Index(['Team', 'W', 'L'], dtype='object')

Subset/Filter Dataframes
Columns
Return a dataframe

df[[col1, col2]]
df[[col1]]
mycols = [col1, col2] -> df[mycols]
Return a series

df[col1]
df.col1
A dataframe will have a column index while series will not. A series will instead have a name for the series that was the original column name you selected.

In [49]:
# return a multi-column dataframe

In [51]:
df1[['Team', 'W']].head(2)

  Team   W
0  LAC  40
1  LAL  35

In [52]:
# return a single column dataframe

In [53]:
df1[['Team']].head(2)

  Team
0  LAC
1  LAL

In [54]:
# return a series using single bracket
df1.Team.head(2)

0    LAC
1    LAL
Name: Team, dtype: object

In [55]:
# return a series using '.': df.colname

In [56]:
df1['Team'].head(3)

0    LAC
1    LAL
2    UTA
Name: Team, dtype: object

## Rows
We can subset a dataframe by filtering rows using a conditional.

For example, df[df.col1 < x] will return all columns and all rows where col1 value is less than x.

In [57]:
df1[df1.W > 30]

  Team   W   L
0  LAC  40  19
1  LAL  35  23
2  UTA  45  15
3  PHX  41  16
5  POR  32  24
9  DEN  37  20

## Subset Columns and Filter Rows
df[df.col1 < x].col2: column 2 and rows where col1 value is less than x. What kind of object is returned?
df[df.col1 < x][[col1, col2]]: columns 1 & 2 and rows where col1 value is less than x. What kind of object is returned?

In [58]:
df1[df1.W > 30][['Team', 'L']]

  Team   L
0  LAC  19
1  LAL  23
2  UTA  15
3  PHX  16
5  POR  24
9  DEN  20

In [59]:
df1[df1.W > 30]['Team']

0    LAC
1    LAL
2    UTA
3    PHX
5    POR
9    DEN
Name: Team, dtype: object

## Drop, Rename, Add Columns
#### Drop

df.drop(colums=[])

In the drop and rename methods (and many others in pandas), the original dataframe is not changed, but instead a new dataframe is produced. However, you can use the inplace argument to change the original dataframe.

In [61]:
df1['losses'] = df1['L']

In [62]:
df1.head()

  Team   W   L  losses
0  LAC  40  19      19
1  LAL  35  23      23
2  UTA  45  15      15
3  PHX  41  16      16
4  GSW  29  29      29

In [63]:
df1.drop(columns=['losses'], inplace=True)

In [64]:
df1

   Team   W   L
0   LAC  40  19
1   LAL  35  23
2   UTA  45  15
3   PHX  41  16
4   GSW  29  29
5   POR  32  24
6   MEM  29  27
7   SAS  28  28
8   DAL  30  26
9   DEN  37  20
10  OKC  20  38
11  NOR  25  32
12  SAC  23  34
13  HOU  15  43
14  MIN  15  43

In [65]:
df1.columns = ['team', 'wins', 'losses']
df1

   team  wins  losses
0   LAC    40      19
1   LAL    35      23
2   UTA    45      15
3   PHX    41      16
4   GSW    29      29
5   POR    32      24
6   MEM    29      27
7   SAS    28      28
8   DAL    30      26
9   DEN    37      20
10  OKC    20      38
11  NOR    25      32
12  SAC    23      34
13  HOU    15      43
14  MIN    15      43

In [66]:
df1.rename(columns={'wins': 'w'}, inplace=True)

In [67]:
df1

   team   w  losses
0   LAC  40      19
1   LAL  35      23
2   UTA  45      15
3   PHX  41      16
4   GSW  29      29
5   POR  32      24
6   MEM  29      27
7   SAS  28      28
8   DAL  30      26
9   DEN  37      20
10  OKC  20      38
11  NOR  25      32
12  SAC  23      34
13  HOU  15      43
14  MIN  15      43

In [69]:
df1.rename(columns={'w':'wins'}, inplace=True)

In [73]:
df1['win_pct'] = 100*df1['wins']/(df1['wins']+df1['losses'])

In [74]:
df1

   team  wins  losses    win_pct
0   LAC    40      19  67.796610
1   LAL    35      23  60.344828
2   UTA    45      15  75.000000
3   PHX    41      16  71.929825
4   GSW    29      29  50.000000
5   POR    32      24  57.142857
6   MEM    29      27  51.785714
7   SAS    28      28  50.000000
8   DAL    30      26  53.571429
9   DEN    37      20  64.912281
10  OKC    20      38  34.482759
11  NOR    25      32  43.859649
12  SAC    23      34  40.350877
13  HOU    15      43  25.862069
14  MIN    15      43  25.862069

In [76]:
df1.info

<bound method DataFrame.info of    team  wins  losses    win_pct
0   LAC    40      19  67.796610
1   LAL    35      23  60.344828
2   UTA    45      15  75.000000
3   PHX    41      16  71.929825
4   GSW    29      29  50.000000
5   POR    32      24  57.142857
6   MEM    29      27  51.785714
7   SAS    28      28  50.000000
8   DAL    30      26  53.571429
9   DEN    37      20  64.912281
10  OKC    20      38  34.482759
11  NOR    25      32  43.859649
12  SAC    23      34  40.350877
13  HOU    15      43  25.862069
14  MIN    15      43  25.862069>

In [70]:
df1.assign('win_pct' = 100*df1['wins']/df1['wins']+df1['losses'])

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (1218686913.py, line 1)